namespace WarehouseManagment.Data
{
    public enum Category
    {
        Колан,
        Протмоне,
        Блуза,
        Елек,
        Жилетка,
        Сако,
        Яке,
        Дънки,
        Комплект,
        КъсПанталон,
        Панталон,
        Пола,
        Потник,
        Риза,
        Рокля,
        Суитшърт,
        Тениска,
        Анорак,
        РизаРокля,
        Топ,
        Горнище,
        Долнище,
        ЗимноЯке,
        КоженоЯке,
        Манто,
        Грейка
      
    }
}
