using System.ComponentModel;

namespace WarehouseManagment.Data
{
    public enum Color
    {
        Черен,
        Бял,
        Зелен,
        [Description("Маслено зелен")]
        МасленоЗелен,
        Неон,
        [Description("Неоново Зелен")]
        НеоновоЗелен,
        Червен,
        Син,
        Сив,
        Розов,
        [Description("Светло Розов")]
        СветлоРозов,
        Жълт,
        Бежов,
        Оранжев,
        Фуксия,
        Петрол,
        Циклама,
        [Description("Бял - неон бранд")]
        БялНеонБранд,
        [Description("Бял - розов бранд")]
        БялРозовБранд,
        [Description("Бял - черен бранд")]
        БялЧеренБранд,
        [Description("Бял - червени петна")]
        БялЧервениПетна,
        [Description("Черен - бежов бранд")]
        ЧеренБежовБранд,
        [Description("Черен - бял бранд")]
        ЧеренБялБранд,
        [Description("Черен - зелен бранд")]
        ЧеренЗеленБранд,
        [Description("Черен - неон бранд")]
        ЧеренНеонБранд,
        [Description("Черен - черен бранд")]
        ЧеренЧеренБранд,
        [Description("Черен - розов бранд")]
        ЧеренРозовБранд
    }
}
